In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("C:\\Users\\PBR\\Desktop\\Datasets\\OfficeSupplies.csv")

In [4]:
df.shape                            # It will give the no of rows and columns in a dataset

(9, 6)

In [5]:
df.OrderDate                        # To print the specific column of a dataframe

0     4-Jul-14
1    12-Jul-14
2    21-Jul-14
3    29-Jul-14
4     7-Aug-14
5    15-Aug-14
6    24-Aug-14
7     1-Sep-14
8    10-Sep-14
Name: OrderDate, dtype: object

# Select records using head(n) and tail(n) functions

In [6]:
df.head(5)                          # To list the first 5 records from the data set

   OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4   7-Aug-14  Central  Matthew  Pen Set     42       23.95

In [7]:
df.tail(3)                          # To list the bottom 3 records of the dataset

   OrderDate   Region    Rep    Item  Units  Unit Price
6  24-Aug-14     West  James    Desk      3      275.00
7   1-Sep-14  Central  Smith    Desk      2      125.00
8  10-Sep-14  Central   Bill  Pencil      7        1.29

In [8]:
df.columns                                  # To display the columns of a data frame.

Index(['OrderDate', 'Region', 'Rep', 'Item', 'Units', 'Unit Price'], dtype='object')

In [9]:
df.head(5)[['OrderDate', 'Region', 'Rep']]  # selecting required columns by passing as a list and displaying 5 records

   OrderDate   Region      Rep
0   4-Jul-14     East  Richard
1  12-Jul-14     East     Nick
2  21-Jul-14  Central   Morgan
3  29-Jul-14     East    Susan
4   7-Aug-14  Central  Matthew

# Applying Statistical Functions on Data Frame

In [10]:
df.max()                           # This will return the max values of all the columns

OrderDate     7-Aug-14
Region            West
Rep              Susan
Item            Pencil
Units               81
Unit Price         275
dtype: object

In [33]:
df.max()['Unit Price']            # Max value of a single coloumns

275.0

In [34]:
df.max()[['Units', 'Unit Price']]  # Max value of multiple columns

Units          81
Unit Price    275
dtype: object

In [35]:
df.max()['Unit Price'], df.min()['Unit Price'], df.mean()['Unit Price'],df.std()['Unit Price'] # Applying functions on multiple columns

(275.0, 1.29, 52.187777777777775, 92.14292549862112)

In [14]:
df.describe()    # This function will print the statistics on all measurable columns

           Units  Unit Price
count   9.000000    9.000000
mean   35.111111   52.187778
std    27.899124   92.142925
min     2.000000    1.290000
25%     7.000000    4.990000
50%    35.000000   12.490000
75%    55.000000   23.950000
max    81.000000  275.000000

# Boolean DataFrame

In [15]:
df>5                              # It will check the condition on all the columns of the table where ever applicable.

   OrderDate  Region   Rep  Item  Units  Unit Price
0       True    True  True  True   True       False
1       True    True  True  True   True       False
2       True    True  True  True   True        True
3       True    True  True  True   True        True
4       True    True  True  True   True        True
5       True    True  True  True   True       False
6       True    True  True  True  False        True
7       True    True  True  True  False        True
8       True    True  True  True   True       False

In [16]:
df[df>5]                    # It will display the actual rows and replace "NaN" where ever the condition is false

   OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-14     East  Richard  Pen Set   62.0         NaN
1  12-Jul-14     East     Nick   Binder   29.0         NaN
2  21-Jul-14  Central   Morgan  Pen Set   55.0       12.49
3  29-Jul-14     East    Susan   Binder   81.0       19.99
4   7-Aug-14  Central  Matthew  Pen Set   42.0       23.95
5  15-Aug-14     East  Richard   Pencil   35.0         NaN
6  24-Aug-14     West    James     Desk    NaN      275.00
7   1-Sep-14  Central    Smith     Desk    NaN      125.00
8  10-Sep-14  Central     Bill   Pencil    7.0         NaN

In [17]:
df['Unit Price']>5               # Applying condition on column and it will return True/False based on condition

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
Name: Unit Price, dtype: bool

In [18]:
df[df['Unit Price']>5]           # type casting to df object it will return the records based on condition

   OrderDate   Region      Rep     Item  Units  Unit Price
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4   7-Aug-14  Central  Matthew  Pen Set     42       23.95
6  24-Aug-14     West    James     Desk      3      275.00
7   1-Sep-14  Central    Smith     Desk      2      125.00

# Conditional Select on Data Frame

In [19]:
df[df['Unit Price']>50]                           # Conditional select like SQL

   OrderDate   Region    Rep  Item  Units  Unit Price
6  24-Aug-14     West  James  Desk      3       275.0
7   1-Sep-14  Central  Smith  Desk      2       125.0

In [20]:
df[df['Unit Price']==125.0]                       # Equi select of rows

  OrderDate   Region    Rep  Item  Units  Unit Price
7  1-Sep-14  Central  Smith  Desk      2       125.0

In [21]:
df[(df['Region']=='Central') & (df['Units']==5)]  # Logical Selection and ensure braces.

Empty DataFrame
Columns: [OrderDate, Region, Rep, Item, Units, Unit Price]
Index: []

# Setting & Resetting Index of DataFrame

In [22]:
df

   OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4   7-Aug-14  Central  Matthew  Pen Set     42       23.95
5  15-Aug-14     East  Richard   Pencil     35        4.99
6  24-Aug-14     West    James     Desk      3      275.00
7   1-Sep-14  Central    Smith     Desk      2      125.00
8  10-Sep-14  Central     Bill   Pencil      7        1.29

In [23]:
df.index                          # This will print the range of Index of Dataframe.

RangeIndex(start=0, stop=9, step=1)

In [24]:
df.set_index('OrderDate')         # This will set the OrderDate as Index by overiding the default index field.

            Region      Rep     Item  Units  Unit Price
OrderDate
4-Jul-14      East  Richard  Pen Set     62        4.99
12-Jul-14     East     Nick   Binder     29        1.99
21-Jul-14  Central   Morgan  Pen Set     55       12.49
29-Jul-14     East    Susan   Binder     81       19.99
7-Aug-14   Central  Matthew  Pen Set     42       23.95
15-Aug-14     East  Richard   Pencil     35        4.99
24-Aug-14     West    James     Desk      3      275.00
1-Sep-14   Central    Smith     Desk      2      125.00
10-Sep-14  Central     Bill   Pencil      7        1.29

In [25]:
df.set_index('OrderDate',inplace=True) # inplace=True will make the change permenatly on DataFrame

In [26]:
df

            Region      Rep     Item  Units  Unit Price
OrderDate
4-Jul-14      East  Richard  Pen Set     62        4.99
12-Jul-14     East     Nick   Binder     29        1.99
21-Jul-14  Central   Morgan  Pen Set     55       12.49
29-Jul-14     East    Susan   Binder     81       19.99
7-Aug-14   Central  Matthew  Pen Set     42       23.95
15-Aug-14     East  Richard   Pencil     35        4.99
24-Aug-14     West    James     Desk      3      275.00
1-Sep-14   Central    Smith     Desk      2      125.00
10-Sep-14  Central     Bill   Pencil      7        1.29

In [27]:
df.index                        # This will display index values.

Index(['4-Jul-14', '12-Jul-14', '21-Jul-14', '29-Jul-14', '7-Aug-14',
       '15-Aug-14', '24-Aug-14', '1-Sep-14', '10-Sep-14'],
      dtype='object', name='OrderDate')

In [28]:
df.loc['15-Aug-14',]             # Retrivew data based on new index using function loc

Region           East
Rep           Richard
Item           Pencil
Units              35
Unit Price       4.99
Name: 15-Aug-14, dtype: object

In [29]:
df.reset_index(inplace=True)     # Resetting the index to default function and ensure inplace=True

In [30]:
df

   OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4   7-Aug-14  Central  Matthew  Pen Set     42       23.95
5  15-Aug-14     East  Richard   Pencil     35        4.99
6  24-Aug-14     West    James     Desk      3      275.00
7   1-Sep-14  Central    Smith     Desk      2      125.00
8  10-Sep-14  Central     Bill   Pencil      7        1.29

# Sorting the DataFrame using sort_index(),sort_values()

In [31]:
df.sort_index()

   OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4   7-Aug-14  Central  Matthew  Pen Set     42       23.95
5  15-Aug-14     East  Richard   Pencil     35        4.99
6  24-Aug-14     West    James     Desk      3      275.00
7   1-Sep-14  Central    Smith     Desk      2      125.00
8  10-Sep-14  Central     Bill   Pencil      7        1.29

In [32]:
df.sort_values(by 'Units',axis=1 )

SyntaxError: invalid syntax (<ipython-input-32-91ce1af1d153>, line 1)